[
  {
    "day": "Day 1",
    "date": "February 19, 2026",
    "title": "When the Moon & The Cross Align",
    "body": "Fatima zahra,\n\nIt seems even the heavens wanted us to do this together. You were so sure Ramadan would begin on the 17th, but it seems the moon was waiting for me to catch up! With Ash Wednesday falling yesterday and your fast officially starting today, there’s something beautiful about us entering this season of discipline side-by-side.\n\nI have to admit, though—trying to keep up with my daily 10k runs while fasting is proving to be a much bigger challenge than I anticipated. My legs feel heavy, and my stomach is definitely voicing its protest by the fifth kilometer! It’s a literal 'run' of faith today.\n\nI’ve been thinking about you all morning. I truly hope your first day of adjustment isn't being too unkind to you. Please don't overextend yourself, okay? If you're feeling the fatigue of the first day, just know I’m right there with you, feeling every bit of that hunger and thirst too.\n\nWe’ve got this. One day, one prayer, and one mile at a time.\n\nAlways yours."
  },
  {
  "day": "Day 2",
  "date": "February 20, 2026",
  "title": "Kulang sa Hangin, Pero Punong-puno sa Pag-ibig",
  "body": "Hi love,\n\nDay 2 palang pero sinusubukan na agad ang willpower ko. Balak ko sana mag-20km kanina, pero hanggang 16km lang talaga ang kinaya. Ramdam ko na yung 'internal protest' ng katawan ko—parang sasabog na yung atay ko sa pagod at gutom, haha! I had to listen to my body and stop, mahirap na.\n\nTo be honest, nahihirapan pa rin talaga akong mag-adjust sa fasting. The hunger is one thing, but the drop in energy while trying to maintain my routine is a different story. I hope ikaw, hindi masyadong nahihirapan dyan. Kumusta ang pakiramdam mo today?\n\nIn between the exhaustion, I actually started something new! I'm diving into a project exploring SEA-PLM (Southeast Asia Primary Learning Metrics) at a student level. It’s keeping my mind busy and distracted from the cravings, somehow. \n\nKahit pagod at gutom, iniisip ko lang na sabay nating nilalampasan 'to, at sapat na 'yun para pagaanin ang lahat.\n\nMag-iingat ka lagi. Mahal kita."
},
{
  "day": "Day 3",
  "date": "February 21, 2026",
  "title": "Winning Streaks & Rest Days",
  "body": "Hi Love,\n\nFinally, a moment to breathe! I’m actually very thankful na pinili kong mag-rest day muna sa pagtakbo. After that 16km struggle yesterday, my body really needed the break. Ang sarap sa pakiramdam na hindi ko muna kailangang makipag-habulan sa hininga ko habang nag-aadjust pa tayo sa fasting.\n\nSpeaking of wins, may katuwaan ako today! I placed a bet on the Clippers with +11.5 against the Lakers... and they actually pulled through! At least kahit gutom at nagpapahinga ang katawan, panalo naman tayo sa diskarte. Small wins like this make the day feel a bit lighter, 'di ba?\n\nI hope you're having a peaceful day too. Sana hindi ka masyadong pagod at nakakahanap ka rin ng time para mag-relax. Isipin mo nalang, we’re three days in—unti-unti na tayong nasasanay.\n\nRest well, my love. I’m always rooting for you, more than any team I bet on.\n\nMahal kita."
}
]